#include<iostream>
using namespace std;
int main(){
    int n;
    cin>>n;
    if(n % 2 == 0 && n > 4 && n <= 12) cout<<"1"<<' ';
    else cout<<"0"<<' ';
	if(n % 2 == 0 ||( n > 4 && n <= 12)) cout<<"1"<<' ';
    else cout<<"0"<<' ';
    if((n % 2 == 0 && (n <= 4 || n > 12))||(n % 2 != 0 && n > 4 && n <= 12)) cout<<"1"<<' ';
    else cout<<"0"<<' ';
    if(n % 2 != 0 && (n <= 4 || n > 12)) cout<<"1";
    else cout<<"0";
    return 0;
    
}
//错误原因，注意逻辑错误，对于两个中只有一个成立的话，
//即对于第三个分支语句，不能说是&& n<=4 && n>12，应该说是&& (n<=4 || n>12)
//同理，第四个分支语句也要注意
//或者对于第三个分支语句，使用(n % 2 == 0) ^ (n > 4 && n <= 12)
//^表示异或运算符，两个操作数中只有一个为真时，结果才为真
//第四个分支语句，!(n % 2 == 0) && !(n > 4 && n <= 12)